local mjlib = require "mjlib"

local function test_wave()
    math.randomseed(os.time())

    for i=1,100 do
        local tbl = {1,1,1,1,1,1}
        local pt = {}
        for j=1, 6 do
            tbl[j] = math.random(1,4)
            pt[j] = tbl[j]
        end

        local total = pt[1] + pt[2] + pt[3] + pt[4] + pt[5] + pt[6]

        if total == 6 or total == 9 or total == 12 then
            if mjlib.check_wave(tbl) then
                print(pt[1],pt[2],pt[3],pt[4],pt[5],pt[6])
                print("测试成功")
            else
                print(pt[1],pt[2],pt[3],pt[4],pt[5],pt[6])
                print("测试失败")
            end
        end
    end
end

local function simple_wave_test()
    local tbl = {
        {3},
        {3,3},
        -- 一组
        {1,1,1},
        -- 二组
        {1,1,4},{1,4,1},{4,1,1},
        -- 三组
        {1,4,4},{4,1,4},{4,4,1},{4,4,4},

        -- 长度 4
        -- 两组
        {1,1,1,3},{3,1,1,1},{1,2,2,1},
        -- 三组
        {1,1,4,3},{1,4,1,3},{4,1,1,3},{3,1,1,4},{3,1,4,1},{3,4,1,1},{2,3,3,1},{1,3,3,2},
        -- 四组
        {2,4,4,2},{3,4,4,1},{1,4,4,3},{3,3,3,3},

        --长度5
        -- 两组
        {1,1,2,1,1},
        -- 三组,无刻
        {2,2,3,1,1},{1,2,3,2,1},{1,1,3,2,2},
        -- 三组，一刻
        {1,1,2,1,4},{1,1,2,4,1},{1,4,2,1,1},{4,1,2,1,1},{3,1,2,2,1},{1,2,2,1,3}
        -- 三组，二刻
        {1,1,1,3,3},{3,3,1,1,1},
        -- 四组，无刻
        {3,3,4,1,1},{2,3,4,2,1},{2,2,4,2,2},
        {2,3,4,2,1},{1,3,4,3,1},{1,2,4,3,2},
        {2,2,4,2,2},{1,2,4,3,2},{1,1,4,3,3},
        -- 四组，一刻
        {2,2,3,1,4},{2,2,3,4,1},
        {1,2,3,2,4},{4,2,3,2,1},
        {1,4,3,2,2},{4,1,3,2,2},
        -- 四组，二刻
        {2,2,3,4,4},{4,2,3,2,4},{4,4,3,2,2},
        -- 四组，三刻
        {1,1,4,3,3},{1,4,1,3,3},{4,1,1,3,3},
        {3,3,1,1,4},{3,3,1,4,1},{3,3,4,1,1},

        -- 长度6
        -- 两组
        {1,1,1,1,1,1},
        -- 三组，无刻
        {1,1,1,2,2,2},{1,1,2,2,2,1},{1,2,2,2,1,1},{2,2,2,1,1,1},
        -- 三组，一刻
        {1,1,1,1,1,4},{1,1,1,1,4,1},{1,1,1,4,1,1},{1,1,4,1,1,1},{1,4,1,1,1,1},{4,1,1,1,1,1},
        -- 四组，无刻
        {2,2,2,2,2,2},{1,2,3,3,2,1},{1,2,3,3,2,1},
        -- 四组，一刻, （由三组无刻 + 刻形成）
        {1,1,4,2,2,2},{1,4,1,2,2,2},{4,1,1,2,2,2},
        {},
        {},
        {},


    }

    for _,v in ipairs(tbl) do
        if not mjlib.check_wave(v) then
            print("测试失败")
        end
    end
    print("测试完成")
end

local function test_wave_1()
    mjlib.check_wave(tbl)
end

local function main()
    simple_wave_test()
end

main()
